app/controllers/customers_controller.rb

INSERT INTO "customers" ("address_city", "address_state", "address_street", "created_at", "email", "image", "name_company", "name_first", "name_last", "phone", "postal_code", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @customer = current_user.customers.create(params[:customer])

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "customers" SET "name_first" = 'Dennis', "name_last" = 'Keefe', "name_company" = '', "email" = 'kelly@grabyourmarket.com', "address_street" = 'P.O. Box 2134', "address_city" = '', "address_state" = 'Florida', "postal_code" = '32444', "phone" = '8505413645', "updated_at" = '2012-11-11 07:04:12.366373' WHERE "customers"."id" = 33
---
  def update
    @customer = Customer.find(params[:id])

    respond_to do |format|
      if @customer.update_attributes(params[:customer])

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "12"]]
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 12]]
---
  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy